liyugoodboy/serialFlashProgrammer/SciFlashAppCpu1_TMS320F28379D/library/driverlib/inc/hw_memcfg.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LSXINIT register
//
//*****************************************************************************
#define MEMCFG_LSXINIT_INIT_LS0   0x1U         // RAM Initialization control
                                               // for LS0 RAM.
#define MEMCFG_LSXINIT_INIT_LS1   0x2U         // RAM Initialization control
                                               // for LS1 RAM.
#define MEMCFG_LSXINIT_INIT_LS2   0x4U         // RAM Initialization control
                                               // for LS2 RAM.
#define MEMCFG_LSXINIT_INIT_LS3   0x8U         // RAM Initialization control
                                               // for LS3 RAM.
#define MEMCFG_LSXINIT_INIT_LS4   0x10U        // RAM Initialization control
                                               // for LS4 RAM.
#define MEMCFG_LSXINIT_INIT_LS5   0x20U        // RAM Initialization control
                                               // for LS5 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the LSXINITDONE register
//
//*****************************************************************************
#define MEMCFG_LSXINITDONE_INITDONE_LS0  0x1U         // RAM Initialization status for
                                               // LS0 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS1  0x2U         // RAM Initialization status for
                                               // LS1 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS2  0x4U         // RAM Initialization status for
                                               // LS2 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS3  0x8U         // RAM Initialization status for
                                               // LS3 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS4  0x10U        // RAM Initialization status for
                                               // LS4 RAM.
#define MEMCFG_LSXINITDONE_INITDONE_LS5  0x20U        // RAM Initialization status for
                                               // LS5 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXLOCK register
//
//*****************************************************************************
#define MEMCFG_GSXLOCK_LOCK_GS0   0x1U         // GS0 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS1   0x2U         // GS1 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS2   0x4U         // GS2 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS3   0x8U         // GS3 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS4   0x10U        // GS4 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS5   0x20U        // GS5 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS6   0x40U        // GS6 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS7   0x80U        // GS7 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS8   0x100U       // GS8 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS9   0x200U       // GS9 RAM access protection and
                                               // master select fields lock bit
#define MEMCFG_GSXLOCK_LOCK_GS10  0x400U       // GS10 RAM access protection
                                               // and master select fields lock
                                               // bit
#define MEMCFG_GSXLOCK_LOCK_GS11  0x800U       // GS11 RAM access protection
                                               // and master select fields lock
                                               // bit
#define MEMCFG_GSXLOCK_LOCK_GS12  0x1000U      // GS12 RAM access protection
                                               // and master select fields lock
                                               // bit
#define MEMCFG_GSXLOCK_LOCK_GS13  0x2000U      // GS13 RAM access protection
                                               // and master select fields lock
                                               // bit
#define MEMCFG_GSXLOCK_LOCK_GS14  0x4000U      // GS14 RAM access protection
                                               // and master select fields lock
                                               // bit
#define MEMCFG_GSXLOCK_LOCK_GS15  0x8000U      // GS15 RAM access protection
                                               // and master select fields lock
                                               // bit

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXCOMMIT register
//
//*****************************************************************************
#define MEMCFG_GSXCOMMIT_COMMIT_GS0  0x1U         // GS0 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS1  0x2U         // GS1 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS2  0x4U         // GS2 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS3  0x8U         // GS3 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS4  0x10U        // GS4 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS5  0x20U        // GS5 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS6  0x40U        // GS6 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS7  0x80U        // GS7 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS8  0x100U       // GS8 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS9  0x200U       // GS9 RAM access protection and
                                               // master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS10  0x400U       // GS10 RAM access protection
                                               // and master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS11  0x800U       // GS11 RAM access protection
                                               // and master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS12  0x1000U      // GS12 RAM access protection
                                               // and master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS13  0x2000U      // GS13 RAM access protection
                                               // and master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS14  0x4000U      // GS14 RAM access protection
                                               // and master select permanent lock
#define MEMCFG_GSXCOMMIT_COMMIT_GS15  0x8000U      // GS15 RAM access protection
                                               // and master select permanent lock

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXMSEL register
//
//*****************************************************************************
#define MEMCFG_GSXMSEL_MSEL_GS0   0x1U         // Master Select for GS0 RAM
#define MEMCFG_GSXMSEL_MSEL_GS1   0x2U         // Master Select for GS1 RAM
#define MEMCFG_GSXMSEL_MSEL_GS2   0x4U         // Master Select for GS2 RAM
#define MEMCFG_GSXMSEL_MSEL_GS3   0x8U         // Master Select for GS3 RAM
#define MEMCFG_GSXMSEL_MSEL_GS4   0x10U        // Master Select for GS4 RAM
#define MEMCFG_GSXMSEL_MSEL_GS5   0x20U        // Master Select for GS5 RAM
#define MEMCFG_GSXMSEL_MSEL_GS6   0x40U        // Master Select for GS6 RAM
#define MEMCFG_GSXMSEL_MSEL_GS7   0x80U        // Master Select for GS7 RAM
#define MEMCFG_GSXMSEL_MSEL_GS8   0x100U       // Master Select for GS8 RAM
#define MEMCFG_GSXMSEL_MSEL_GS9   0x200U       // Master Select for GS9 RAM
#define MEMCFG_GSXMSEL_MSEL_GS10  0x400U       // Master Select for GS10 RAM
#define MEMCFG_GSXMSEL_MSEL_GS11  0x800U       // Master Select for GS11 RAM
#define MEMCFG_GSXMSEL_MSEL_GS12  0x1000U      // Master Select for GS12 RAM
#define MEMCFG_GSXMSEL_MSEL_GS13  0x2000U      // Master Select for GS13 RAM
#define MEMCFG_GSXMSEL_MSEL_GS14  0x4000U      // Master Select for GS14 RAM
#define MEMCFG_GSXMSEL_MSEL_GS15  0x8000U      // Master Select for GS15 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT0 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS0  0x1U         // Fetch Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS0  0x2U         // CPU WR Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS0  0x4U         // DMA WR Protection For GS0 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS1  0x100U       // Fetch Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS1  0x200U       // CPU WR Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS1  0x400U       // DMA WR Protection For GS1 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS2  0x10000U     // Fetch Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS2  0x20000U     // CPU WR Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS2  0x40000U     // DMA WR Protection For GS2 RAM
#define MEMCFG_GSXACCPROT0_FETCHPROT_GS3  0x1000000U   // Fetch Protection For GS3 RAM
#define MEMCFG_GSXACCPROT0_CPUWRPROT_GS3  0x2000000U   // CPU WR Protection For GS3 RAM
#define MEMCFG_GSXACCPROT0_DMAWRPROT_GS3  0x4000000U   // DMA WR Protection For GS3 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT1 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS4  0x1U         // Fetch Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS4  0x2U         // CPU WR Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS4  0x4U         // DMA WR Protection For GS4 RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS5  0x100U       // Fetch Protection For GS5 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS5  0x200U       // CPU WR Protection For GS5 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS5  0x400U       // DMA WR Protection For GS5RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS6  0x10000U     // Fetch Protection For GS6 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS6  0x20000U     // CPU WR Protection For GS6 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS6  0x40000U     // DMA WR Protection For GS6RAM
#define MEMCFG_GSXACCPROT1_FETCHPROT_GS7  0x1000000U   // Fetch Protection For GS7 RAM
#define MEMCFG_GSXACCPROT1_CPUWRPROT_GS7  0x2000000U   // CPU WR Protection For GS7 RAM
#define MEMCFG_GSXACCPROT1_DMAWRPROT_GS7  0x4000000U   // DMA WR Protection For GS7RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT2 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS8  0x1U         // Fetch Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS8  0x2U         // CPU WR Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS8  0x4U         // DMA WR Protection For GS8 RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS9  0x100U       // Fetch Protection For GS9 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS9  0x200U       // CPU WR Protection For GS9 RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS9  0x400U       // DMA WR Protection For GS9RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS10  0x10000U     // Fetch Protection For GS10 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS10  0x20000U     // CPU WR Protection For GS10
                                               // RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS10  0x40000U     // DMA WR Protection For GS10RAM
#define MEMCFG_GSXACCPROT2_FETCHPROT_GS11  0x1000000U   // Fetch Protection For GS11 RAM
#define MEMCFG_GSXACCPROT2_CPUWRPROT_GS11  0x2000000U   // CPU WR Protection For GS11
                                               // RAM
#define MEMCFG_GSXACCPROT2_DMAWRPROT_GS11  0x4000000U   // DMA WR Protection For GS11RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXACCPROT3 register
//
//*****************************************************************************
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS12  0x1U         // Fetch Protection For GS12 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS12  0x2U         // CPU WR Protection For GS12
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS12  0x4U         // DMA WR Protection For GS12
                                               // RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS13  0x100U       // Fetch Protection For GS13 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS13  0x200U       // CPU WR Protection For GS13
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS13  0x400U       // DMA WR Protection For GS13RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS14  0x10000U     // Fetch Protection For GS14 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS14  0x20000U     // CPU WR Protection For GS14
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS14  0x40000U     // DMA WR Protection For GS14RAM
#define MEMCFG_GSXACCPROT3_FETCHPROT_GS15  0x1000000U   // Fetch Protection For GS15 RAM
#define MEMCFG_GSXACCPROT3_CPUWRPROT_GS15  0x2000000U   // CPU WR Protection For GS15
                                               // RAM
#define MEMCFG_GSXACCPROT3_DMAWRPROT_GS15  0x4000000U   // DMA WR Protection For GS15RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXTEST register
//
//*****************************************************************************
#define MEMCFG_GSXTEST_TEST_GS0_S  0U
#define MEMCFG_GSXTEST_TEST_GS0_M  0x3U         // Selects the different modes
                                               // for GS0 RAM
#define MEMCFG_GSXTEST_TEST_GS1_S  2U
#define MEMCFG_GSXTEST_TEST_GS1_M  0xCU         // Selects the different modes
                                               // for GS1 RAM
#define MEMCFG_GSXTEST_TEST_GS2_S  4U
#define MEMCFG_GSXTEST_TEST_GS2_M  0x30U        // Selects the different modes
                                               // for GS2 RAM
#define MEMCFG_GSXTEST_TEST_GS3_S  6U
#define MEMCFG_GSXTEST_TEST_GS3_M  0xC0U        // Selects the different modes
                                               // for GS3 RAM
#define MEMCFG_GSXTEST_TEST_GS4_S  8U
#define MEMCFG_GSXTEST_TEST_GS4_M  0x300U       // Selects the different modes
                                               // for GS4 RAM
#define MEMCFG_GSXTEST_TEST_GS5_S  10U
#define MEMCFG_GSXTEST_TEST_GS5_M  0xC00U       // Selects the different modes
                                               // for GS5 RAM
#define MEMCFG_GSXTEST_TEST_GS6_S  12U
#define MEMCFG_GSXTEST_TEST_GS6_M  0x3000U      // Selects the different modes
                                               // for GS6 RAM
#define MEMCFG_GSXTEST_TEST_GS7_S  14U
#define MEMCFG_GSXTEST_TEST_GS7_M  0xC000U      // Selects the different modes
                                               // for GS7 RAM
#define MEMCFG_GSXTEST_TEST_GS8_S  16U
#define MEMCFG_GSXTEST_TEST_GS8_M  0x30000U     // Selects the different modes
                                               // for GS8 RAM
#define MEMCFG_GSXTEST_TEST_GS9_S  18U
#define MEMCFG_GSXTEST_TEST_GS9_M  0xC0000U     // Selects the different modes
                                               // for GS9 RAM
#define MEMCFG_GSXTEST_TEST_GS10_S  20U
#define MEMCFG_GSXTEST_TEST_GS10_M  0x300000U    // Selects the different modes
                                               // for GS10 RAM
#define MEMCFG_GSXTEST_TEST_GS11_S  22U
#define MEMCFG_GSXTEST_TEST_GS11_M  0xC00000U    // Selects the different modes
                                               // for GS11 RAM
#define MEMCFG_GSXTEST_TEST_GS12_S  24U
#define MEMCFG_GSXTEST_TEST_GS12_M  0x3000000U   // Selects the different modes
                                               // for GS12 RAM
#define MEMCFG_GSXTEST_TEST_GS13_S  26U
#define MEMCFG_GSXTEST_TEST_GS13_M  0xC000000U   // Selects the different modes
                                               // for GS13 RAM
#define MEMCFG_GSXTEST_TEST_GS14_S  28U
#define MEMCFG_GSXTEST_TEST_GS14_M  0x30000000U  // Selects the different modes
                                               // for GS14 RAM
#define MEMCFG_GSXTEST_TEST_GS15_S  30U
#define MEMCFG_GSXTEST_TEST_GS15_M  0xC0000000U  // Selects the different modes
                                               // for GS15 RAM

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXINIT register
//
//*****************************************************************************
#define MEMCFG_GSXINIT_INIT_GS0   0x1U         // RAM Initialization control
                                               // for GS0 RAM.
#define MEMCFG_GSXINIT_INIT_GS1   0x2U         // RAM Initialization control
                                               // for GS1 RAM.
#define MEMCFG_GSXINIT_INIT_GS2   0x4U         // RAM Initialization control
                                               // for GS2 RAM.
#define MEMCFG_GSXINIT_INIT_GS3   0x8U         // RAM Initialization control
                                               // for GS3 RAM.
#define MEMCFG_GSXINIT_INIT_GS4   0x10U        // RAM Initialization control
                                               // for GS4 RAM.
#define MEMCFG_GSXINIT_INIT_GS5   0x20U        // RAM Initialization control
                                               // for GS5 RAM.
#define MEMCFG_GSXINIT_INIT_GS6   0x40U        // RAM Initialization control
                                               // for GS6 RAM.
#define MEMCFG_GSXINIT_INIT_GS7   0x80U        // RAM Initialization control
                                               // for GS7 RAM.
#define MEMCFG_GSXINIT_INIT_GS8   0x100U       // RAM Initialization control
                                               // for GS8 RAM.
#define MEMCFG_GSXINIT_INIT_GS9   0x200U       // RAM Initialization control
                                               // for GS9 RAM.
#define MEMCFG_GSXINIT_INIT_GS10  0x400U       // RAM Initialization control
                                               // for GS10 RAM.
#define MEMCFG_GSXINIT_INIT_GS11  0x800U       // RAM Initialization control
                                               // for GS11 RAM.
#define MEMCFG_GSXINIT_INIT_GS12  0x1000U      // RAM Initialization control
                                               // for GS12 RAM.
#define MEMCFG_GSXINIT_INIT_GS13  0x2000U      // RAM Initialization control
                                               // for GS13 RAM.
#define MEMCFG_GSXINIT_INIT_GS14  0x4000U      // RAM Initialization control
                                               // for GS14 RAM.
#define MEMCFG_GSXINIT_INIT_GS15  0x8000U      // RAM Initialization control
                                               // for GS15 RAM.

//*****************************************************************************
//
// The following are defines for the bit fields in the GSXINITDONE register
//
//*****************************************************************************
#define MEMCFG_GSXINITDONE_INITDONE_GS0  0x1U         // RAM Initialization status for
                                               // GS0 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS1  0x2U         // RAM Initialization status for
                                               // GS1 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS2  0x4U         // RAM Initialization status for
                                               // GS2 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS3  0x8U         // RAM Initialization status for
                                               // GS3 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS4  0x10U        // RAM Initialization status for
                                               // GS4 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS5  0x20U        // RAM Initialization status for
                                               // GS5 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS6  0x40U        // RAM Initialization status for
                                               // GS6 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS7  0x80U        // RAM Initialization status for
                                               // GS7 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS8  0x100U       // RAM Initialization status for
                                               // GS8 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS9  0x200U       // RAM Initialization status for
                                               // GS9 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS10  0x400U       // RAM Initialization status for
                                               // GS10 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS11  0x800U       // RAM Initialization status for
                                               // GS11 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS12  0x1000U      // RAM Initialization status for
                                               // GS12 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS13  0x2000U      // RAM Initialization status for
                                               // GS13 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS14  0x4000U      // RAM Initialization status for
                                               // GS14 RAM.
#define MEMCFG_GSXINITDONE_INITDONE_GS15  0x8000U      // RAM Initialization status for
                                               // GS15 RAM.

